##  Target Guided Ordinal Encoding 
It is a technique used to encode categorical variables based on their relationship with the target variable. This encoding technique is
useful when we have a categorical variable with a large number of unique categories, and we want to use this variable as a feature in our 
machine learning model.

In Target Guided Ordinal Encoding, we replace each category in the categorical variable with a numerical value based on the mean or median 
of the target variable for that category. This creates a monotonic relationship between the categorical variable and the target 
variable, which can improve the predictive power of our model.

In [1]:
import pandas as pd

In [10]:
df=pd.DataFrame({'city':['new york','london','paris','tokyo','new york','paris'],
             'price':[1000,1200,800,1100,500,600]})

In [11]:
df

       city  price
0  new york   1000
1    london   1200
2     paris    800
3     tokyo   1100
4  new york    500
5     paris    600

In [13]:
mean_value=df.groupby('city')['price'].mean()

In [15]:
mean_value.to_dict()

{'london': 1200.0, 'new york': 750.0, 'paris': 700.0, 'tokyo': 1100.0}

In [16]:
df['encoded_city']=df['city'].map(mean_value)

In [17]:
df

       city  price  encoded_city
0  new york   1000         750.0
1    london   1200        1200.0
2     paris    800         700.0
3     tokyo   1100        1100.0
4  new york    500         750.0
5     paris    600         700.0